Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Выбрать все — помечает все узлы.
en: Check all enables to check all nodes.

source: Вырезать — вырезать выбранный файл или папку и поместить в буфер обмена;
en: Cut: cut the selected file or folder and place to the clipboard.

source: Выходной набор данных — на порт выводится таблица с набором данных, отсортированным по выбранным полям.
en: Output data set: the table with the data set sorted by the selected fields is output to the port.

source: Выходной набор данных — таблица данных.
en: Output data set: data table.

source: Гистограмма — операция, открывающая детализированное окно с расширенными настройками гистограммы.
en: Histogram: the operation that enables to open the detailed window with advanced histogram settings.

source: Главная таблица — порт для входного набора данных.
en: Main table: the port for the input data set.

source: Дерево — переключение отображения коэффициентов регрессии в вид Дерево;
en: Tree: switch of display of regression coefficients to the Tree form.

source: Детализация — показать/скрыть детализацию по строке таблицы;
en: Detailing: show/hide detailing by the table row;

source: Добавить дочерний узел — позволяет добавить к корневому узлу дочерний узел.
en: Add child node enables to add the child node to the root node.

source: Добавить еще один порт — создает новые порты входа для присоединяемых таблиц и переменных.
en: Add another port enables to create new input ports for the joined tables and variables.

source: Добавить соседний узел — позволяет создать узел того же уровня иерархии, что и выбранный.
en: Add neighboring node enables to create the node of the same hierarchic level as provided for the selected one.

source: Добавить — добавляет новое поле в список настраиваемых столбцов и открывает диалог редактирования его параметров.
en: Add enables to add the new field to the list of configured columns and open the dialog of its features editing.

source: Добавить — добавляет новое поле в список настраиваемых столбцов и открывает диалог редактирования его параметров;
en: Add enables to add the new field to the list of configured columns and open the dialog of its features editing.

source: Добавление — к настраиваемым столбцам добавляются поля, вычисленные на основе обрабатываемых полей;
en: Add: the fields calculated on the basis of the processd fields are added to the configured columns.

source: Загрузить из XSD... - загружает структуру узлов выходного дерева из файла формата XSD.
en: Load from XSD... enables to load the structure of nodes of the output tree from the XSD file.

source: Загрузить — позволяет загрузить файл в открытую в текущий момент директорию, файл для загрузки следует выбрать во всплывшем окне проводника Windows;
en: Load: load a file to the currently opened directory. It is required to select the file to be loaded in the pop-up Windows Explorer window.

source: Замена — вычисленные поля замещают обрабатываемые.
en: Replace: the calculated fields are replaced with the processed ones.

source: Заморожено — показывает, что при переобучении данное поле не будет использоваться.
en: Locked shows that this field will not be used while overfitting.

source: Инвертировать выделение – меняет выбранные узлы на невыбранные и наоборот.
en: Invert selection enables to invert the selected nodes to unselected and vice versa.

source: Инвертировать выделение — поменять выбранные узлы на невыбранные и наоборот.
en: Invert selection enables to invert the selected nodes to unselected and vice versa.

source: Индекс Джини - поскольку в выходном наборе выводится только класс с наибольшей вероятностью, то для того, чтобы оценить, насколько уверенно классификатор назначил класс, на основе апостериорных вероятностей подсчитывается индекс Джини.
en: Gini index: as only the class with the highest probability is displayed in the output data set, the Gini index is calculated to estimate the accuracy of the class assignment by the classifier according to the posterior probabilities.

source: Информация о модели — отображение/скрытие информации о модели.
en: Model info: show/hide Model info.

source: Класс | Прогноз - обозначение прогнозируемого класса.
en: Class | Prediction: identification of the predicted class.

source: Класс | Факт - фактический класс.
en: Class | Fact: the actual fact.

source: Копировать — копирование выбранного файла или папки в буфер обмена;
en: Copy: copy the selected file or folder to the clipboard.

source: Настроить порядок выполнения — позволяет задать собственный порядок выполнения узлов;
en: Customize execution order enables to set one's own order of nodes execution.

source: Настроить режим активации узла — настройка режима активации выделенного узла;
en: Configure node activation mode provides configuration of activation mode for the selected node.

source: Настроить — открывает диалог редактирования параметров поля, диалог также можно открыть двойным кликом по выбранной строке таблицы.
en: Configure enables to open the dialog of editing of field features. The dialog can be also opened by double clicking on the selected table row.

source: Настроить — открывает диалог редактирования параметров поля, диалог также можно открыть двойным кликом по выбранному полю;
en: Configure enables to open the dialog of editing of field features. The dialog can be also opened by double clicking on the selected field.

source: Настройка показателей — выбор статистических показателей;
en: Configure indicators: selection of the statistical indicators.

source: Настройка полей — выбор полей набора данных, для которых будут подсчитаны статистические показатели;
en: Configure fields: selection of the data set fields for which the statistical indicators will be calculated.

source: Настройки осей.
en: Configure axes.

source: Настройки серий — настройки списка серий и параметров конкретных серий (графиков).
en: Series editor: settings of the series list and parameters of particular series (graphic charts).

source: Номер строки — показать/скрыть сквозной номер строки;
en: Row number: show/hide continuous row number;

source: Нулевые значения — отображение/скрытие нулевых значений.
en: Zero values: show/hide zero values.

source: Нулевые значения — отображение/скрытие нулевых значений;
en: Zero values: show/hide zero values;

source: Обновить список — отображает актуальное содержание текущей директории.
en: Update list: display the actual contents of the current directory.

source: Общие настройки — настройки диаграммы в целом.
en: General settings: general chart settings.

source: Объединить с предыдущим — объединяет конечный класс, выделенный на диаграмме или в таблице детализации, с предыдущим (расположенным левее) классом (кнопка доступна в режиме редактирования разбиения, т.е. когда нажата кнопка Редактировать разбиение);
en: Merge with previous: enables to merge the coarse class selected in the chart or detailing table with the previous (located more to the left) class (the button is available in the binning editing mode, namely, when Edit binning button has been pressed).

source: Объединить со следующим — объединяет конечный класс, выделенный на диаграмме или в таблице детализации, с последующим (расположенным правее) классом (кнопка доступна в режиме редактирования разбиения);
en: Merge with next: enables to merge the coarse class selected in the chart or detailing table with the next (located more to the right) class (the button is available in the binning editing mode).

source: Отменить выполнение всех процессов... — останавливает выполнение всех процессов;
en: Cancel all processes... enables to cancel execution of all processes.

source: Отменить — останавливает выполнение выбранного процесса;
en: Cancel enables to cancel execution of the selected process.

source: Отображать потерянные связи — отображаются отсутствующие поля входного набора порта, с которыми ранее были настроены связи с существующими полями выходного набора.
en: Show lost links: the missing fields of the input data set of the port with which links with the existing fields of the output data set have been earlier configured.

source: Переименовать — изменение имени выбранной папки;
en: Rename: change the name of the selected folder.

source: Переместить вверх и Переместить вниз — позволяют менять порядок узлов, при этом корневой узел Root переместить нельзя (команды также доступны по комбинации горячих клавиш Ctrl+Up и Ctrl+Down соответственно).
en: Move up and Move down enable to change the order of nodes. In this case, it is not possible to move the Root root node (the commands are also available when using Ctrl+Up and Ctrl+Down combinations of hotkeys, correspondingly).

source: Переместить вверх — перемещает выбранное поле вверх в списке очередности;
en: Move up enables to move the selected field up in the order list.

source: Переместить вверх — перемещает выделенное Поле сортировки вверх по списку;
en: Move up enables to move the selected Sort field up the list.

source: Переместить вниз — перемещает выбранное поле вниз в списке очередности.
en: Move down enables to move the selected field down in the order list.

source: Переместить вниз — перемещает выделенное Поле сортировки вниз по списку.
en: Move down enables to move the selected Sort field down the list.

source: Переобучить узел — переобучает выделенный узел;
en: Retrain node enables to retrain the selected node.

source: По умолчанию — индивидуален для каждого компонента, реализует либо режим Замена, либо Добавление;
en: By default: it is specific for each component, and it implements either Replace mode, or Add mode.

source: Показать диаграммы конечных классов — область конечных классов будет представлена в виде диаграмм (Alt+Two).
en: Show coarse class charts: the coarse class area will be represented in the chart form (Alt+Two).

source: Показать значения null — показать/скрыть null-значения;
en: Show null values: show/hide null values;

source: Показать таблицу конечных классов — область конечных классов будет представлена в виде таблицы (можно также вызвать начатием клавиш Alt+One);
en: Show coarse class table: the coarse class area will be represented in the table form (it can be also called by pressing Alt+One).

source: Получить список — загрузка списка входных полей в случае его отсутствия (например, если импорт из базы данных задается через SQL-запрос).
en: Get list: downloading of the input fields list in the case of its absence (for example, if import from the database is set via the SQL request).

source: Порядковые статистики— подсчитываются порядковые статистики;
en: Order statistics: the order statistics are calculated.

source: Развернуть - разворачивает узел дерева.
en: Expand enables to expand the tree node.

source: Разморожено — показывает, что данное поле может быть использовано в процессе формирования конечных классов при переобучении модели.
en: Unlocked shows whether this field can be used in the process of the coarse classes generation while model overfitting.

source: Редактировать разбиение — при нажатии на кнопку становятся доступны поля для редактирования параметров конечных классов;
en: Edit binning: the fields used for editing of the coarse classes parameters become available by pressing this button.

source: Редактировать... — позволяет вызвать окно редактирования и изменить значения полей для выбранного узла (команду также можно вызвать горячей клавишей F2).
en: Edit... enables to call the editing window and change values of the fields for the selected node (the command can be called using F2 hotkey).

source: Свернуть - сворачивает узел дерева.
en: Collapse enables to collapse the tree node.

source: Связать автоматически — предпринимается попытка установить связи между выходным и входным списком полей/переменных.
en: Auto link: there is an attempt to establish the links between the output and input list of fields/variables.

source: Синхронизировать поля — синхронизируется список выходных полей порта со списком входных (алгоритм синхронизации см.
en: Map fields enables to map a list of output port fields to a list of the input ones (the mapping algorithm is described in the

source: Синхронизировать поля — синхронизируется список выходных полей/переменных порта со списком входных (алгоритм синхронизации см.
en: Map fields: the list of the output fields/variables of the port is mapped with the list of the input ones (more detailed information on the mapping algorithm is provided in

source: Скачать — скачать выбранный элемент в системную папку загрузок пользователя; файлы также можно скачивать, делая по ним двойной клик левой кнопкой мыши;
en: Download: dowload the selected item to the system folder for user downloads. It is also possible to download files by double clicking on them with the left mouse button.

source: Скрыть боковую панель — нажатие на кнопку скрывает панель со списком входных столбцов, повторное нажатие возвращает панель;
en: Hide side bar: press this button to hide the bar with a list of input columns, press it again to return the bar.

source: Снять выделение со всех – снимает выделение со всех узлов.
en: Deselect all enables to deselect all nodes.

source: Снять выделение со всех — снимает выделение со всех узлов.
en: Deselect all enables to deselect all nodes.

source: Создать выходной... — создает для выбранного входного поля/переменной такое же поле в списке "Выходные" и устанавливает с ним соответствие.
en: Create output... enables to create the same field for the selected input field/variable in the "Output" list and provide mapping with it.

source: Создать выходные для всех входных... — создает для всех входных полей/переменных такие же поля в списке "Выходные" и устанавливает с ними соответствие.
en: Create output for all input... enables to create the same fields in the "Output" list for all input fields/variables and provide mapping with them.

source: Создать каталог — создание папки в директории, открытой в текущий момент;
en: Create directory: folder creation in the currently opened directory.

source: Сортировка — открыть окно настройки сортировки данных по столбцам;
en: Sort: open data sorting configuration window by columns;

source: Таблица — переключение отображения коэффициентов регрессии в вид Таблица;
en: Table: switch of display of regression coefficients to the Table form.

source: Типы данных — показать/скрыть типы данных;
en: Data types: show/hide data types;

source: Транспонирование таблицы — переворот таблицы, при котором наименования полей отображаются в столбцах, а статистические показатели — в строках;
en: Table transposing: turn of the table when the fields names are displayed in columns, and the statistical indicators are displayed in rows.

source: Удалить все заверенные процессы... — удаляет все завершенные процессы из списка информационной панели;
en: Delete all completed processes... enables to delete all completed processes from the information panel list.

source: Удалить все связи — удаляет все имеющиеся связи.
en: Delete all links enables to delete all available links.

source: Удалить все... — список "Выходные" очищается.
en: Delete all...: the "Input" list is cleared.

source: Удалить все... — список "Выходные" очищается;
en: Delete all...: the "Output" list is cleared.

source: Удалить все — удаляет все элементы текущей директории.
en: Delete all: delete all items of the current directory.

source: Удалить из списка — удаляет процесс из списка информационной панели;
en: Remove from list enables to remove the process from the information panel list.

source: Удалить поле.
en: Delete field.

source: Удалить — удаление выбранного файла или папки;
en: Delete: delete the selected file or folder.

source: Удалить — удаляет выделенную позицию в списке "Выходные", иконка этой команды высвечивается при наведении курсора на эту позицию.
en: Delete enables to delete the selected position in the "Output" list. The icon of this command is highlighted when hovering cursor over this position.

source: Удалить — удаляет дочерний узел дерева, иконка этой команды высвечивается при наведении курсора на узел (команду также можно вызвать горячей клавишей Delete).
en: Delete enables to delete the child node of the tree, this command icon is highlighted when hovering a cursor over the node (the command can be also called by Delete hotkey).

source: Уникальные значения— подсчитывается количество уникальных значений;
en: Unique values: the count of unique values is calculated.

source: Упорядочить связи — пересортировывает поля списков для устранения пересечений связей друг с другом.
en: Arrange links enables to resort lists fields to delete the crossing links.

source: Управляющие переменные (необязательный порт) — переменными порта можно задать значения параметров мастера настройки.
en: Control variables (optional port): it is possible to set values of the wizard parameters using the port variables.

source: Фильтр — открыть окно настройки фильтрации;
en: Filter: open filtration configuration window;

source: Формат — открыть окно настройки формата отображения данных;
en: Format: open format configuration window of data view;

source: Шаги построения — отображение/скрытие шагов построения модели.
en: Model steps: show/hide model steps.

source: Экспорт — экспортировать таблицу в файл выбранного формата (XLS или HTML);
en: Export: export table to the file of the selected format (XLS or HTML);

source: Автоматическое упорядочивание узлов — автоматическое расположение узлов на области Сценария в соответствии с их последовательностью обработки данных;
en: Auto node alignment: the automatic placement of nodes in the Workflow area according to their sequence of data processing.

source: Активировать/ Деактивировать узел — активировать/деактивировать узел;
en: Activate/ Deactivate node enables to activate/deactivate a node.

source: Анимация — обновление данных отображается плавно.
en: Animation: data update is smoothly displayed.

source: Вертикальное выравнивание — позволяет выровнять вертикально узлы Сценария на области построения.
en: Vertical alignment provides vertical alignment of the Workflow nodes in the construction area.

source: Вещественный
en: Real

source: Вещественный, Переменный
en: Real, Variable

source: Вещественный;
en: Real;

source: Вид данных не задан
en: No data kind defined

source: Водопад;
en: Waterfall;

source: Входной источник данных (таблица данных), необязательный;
en: Input data source (data table), optional.

source: Выполнить все — выполнить все узлы Сценария;
en: Run all enables to run all nodes of the Workflow.

source: Выходной набор данных — таблица, содержащая результирующие XML и их идентификаторы (ID).
en: Output data set: the table that contains resulting XML and their identifiers (ID).

source: Горячие клавиши
en: Hotkeys

source: Группа
en: Group

source: Группировать (Alt+G) — список Производных компонентов группируется по типу базового узла (Импорт, Трансформация, Управление, Исследования и т.д.);
en: Group (Alt+G): the list of the Derived Components is grouped by the base node type (Import, Transformation, Control, Exploration, etc.);

source: Дата/Время.
en: Date/Time.

source: Дата/время
en: Date/time

source: Дата/время, Переменный
en: Date/time, Variable

source: Дерево в таблицу
en: Tree to Table

source: Диаграмма
en: Chart

source: Добавить еще один порт – создает новый порт Входной источник данныхN, где N – порядковый номер порта;
en: Add another port enables to create a new port - Input data sourceN where N is an order port number.

source: Добавить.
en: Add.

source: Доступ к входным наборам данных
en: Access to the Input Data Sets

source: Доступ к входным переменным
en: Access to the Input Variables

source: Доступ к выходному набору данных
en: Access to the Output Data Set

source: Импорт внешних модулей
en: Import of External Modules

source: Импорт функций Калькулятора
en: Calculator Functions Import

source: Исключенное
en: Excluded

source: Использовать как поле абсцисс (CTRL+X);
en: Use as abscissa field (CTRL+X);

source: Использовать как поле меток (Alt+L).
en: Use as caption field (Alt+L).

source: Используемое
en: Active

source: Источник данных — набор данных, подлежащий преобразованию.
en: Data source: the data set to be transformed.

source: Клонировать узел — клонирование выделенного узла;
en: Clone node enables to clone the selected node.

source: Ключ
en: Key

source: Консоль
en: Console

source: Линейная регрессия
en: Linear Regression

source: Линии;
en: Lines;

source: Логический
en: Logical

source: Логический, Переменный
en: Logical, Variable

source: Навигатор — позволяет детализировать по оси X какой-либо участок диаграммы, отображается снизу под осью.
en: Navigator: detail any chart section along the X axis, it is displayed under the axis.

source: Назначение не задано
en: No usage type specified

source: Настроить узел — заходит в настройки выделенного узла;
en: Configure node provides access to setting of the selected node.

source: Настроить — открывается окно настройки выбранного Производного компонента;
en: Configure: the configuration window of the selected Derived Component will be opened.

source: Настроить — открывается окно настройки выделенного в списке Производного компонента;
en: Configure: the configuration window of the Derived Component selected in the list will be opened.

source: Настройка полей — показать/скрыть список полей набора данных.
en: Configure fields: show/hide the list of the data set fields.

source: Настройка сортировки
en: Configure Sorting

source: Не отображать.
en: Disabled.

source: Непригодное
en: Useless

source: Нормировать — приводит все графики к одному масштабу.
en: Rationing: set the same scale for all charts.

source: Области с интервалами;
en: Interval areas;

source: Области;
en: Areas;

source: Отдалить — отдаляет/уменьшает область диаграммы.
en: Zoom out enables to zoom out the chart area.

source: Отчет по регрессии
en: Regression Report

source: Ошибки;
en: Errors;

source: Переменный
en: Variant

source: Переместить вверх.
en: Move up.

source: Переместить вниз.
en: Move down.

source: Переместить выделенные узлы — выставляет выделенные узлы и их подписи на:
en: Send selected nodes enables to bring selected nodes and their signatures to:

source: Перечисления встроенных сущностей Loginom
en: Enumerations of the Loginom Built-in Entities

source: Повернуть график — меняет местами оси, то есть поле по X перемещается на ось Y, и наоборот ось Y становится осью X.
en: Rotate chart enables to reverse the axes positions, namely, the field along the X axis is moved to the Y axis, and vice versa, the Y axis becomes the X axis.

source: Подключение REST-сервиса
en: REST Service Connection

source: Подключение к источнику XSD-схемы (обязательный порт) — связь с узлом подключения набора XSD-схем.
en: Connect to XSD schema source (required port) allows for connection to Connection to set of the XSD schemas node.

source: Показатель
en: Value

source: Показать в виде сценария — отображает Сценарий в стандартном виде (в виде направленного графа);
en: Show as workflow enables to display a Workflow in the standard form (in the form of oriented graph).

source: Показать в виде таблицы — компактное отображение Сценария в виде таблицы, содержащей используемые элементы;
en: Show as table provides compact display of the Workflow in the form of a table that contains used items.

source: Показать исходные узлы для Узлов-ссылок — при наличии Узлов-ссылок показывает узлы, на основе которых они создавались;
en: Show source nodes for Reference Nodes shows the nodes on the basis of which Reference Nodes were created, if any.
